akhil-tsdev/With_SensorFusion/wearable/Freescale/Freescale_MQX_4_1/mqx/source/io/spi_ksdk_1_3_0/include/MK22FA12/MK22FA12_spi.h
///* ----------------------------------------------------------------------------
//   -- SPI Register Masks
//   ---------------------------------------------------------------------------- */
//
///*!
// * @addtogroup SPI_Register_Masks SPI Register Masks
// * @{
// */
//
///* MCR Bit Fields */
//#define SPI_MCR_HALT_MASK                        0x1u
//#define SPI_MCR_HALT_SHIFT                       0
//#define SPI_MCR_HALT_WIDTH                       1
//#define SPI_MCR_HALT(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_MCR_HALT_SHIFT))&SPI_MCR_HALT_MASK)
//#define SPI_MCR_SMPL_PT_MASK                     0x300u
//#define SPI_MCR_SMPL_PT_SHIFT                    8
//#define SPI_MCR_SMPL_PT_WIDTH                    2
//#define SPI_MCR_SMPL_PT(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_MCR_SMPL_PT_SHIFT))&SPI_MCR_SMPL_PT_MASK)
//#define SPI_MCR_CLR_RXF_MASK                     0x400u
//#define SPI_MCR_CLR_RXF_SHIFT                    10
//#define SPI_MCR_CLR_RXF_WIDTH                    1
//#define SPI_MCR_CLR_RXF(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_MCR_CLR_RXF_SHIFT))&SPI_MCR_CLR_RXF_MASK)
//#define SPI_MCR_CLR_TXF_MASK                     0x800u
//#define SPI_MCR_CLR_TXF_SHIFT                    11
//#define SPI_MCR_CLR_TXF_WIDTH                    1
//#define SPI_MCR_CLR_TXF(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_MCR_CLR_TXF_SHIFT))&SPI_MCR_CLR_TXF_MASK)
//#define SPI_MCR_DIS_RXF_MASK                     0x1000u
//#define SPI_MCR_DIS_RXF_SHIFT                    12
//#define SPI_MCR_DIS_RXF_WIDTH                    1
//#define SPI_MCR_DIS_RXF(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_MCR_DIS_RXF_SHIFT))&SPI_MCR_DIS_RXF_MASK)
//#define SPI_MCR_DIS_TXF_MASK                     0x2000u
//#define SPI_MCR_DIS_TXF_SHIFT                    13
//#define SPI_MCR_DIS_TXF_WIDTH                    1
//#define SPI_MCR_DIS_TXF(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_MCR_DIS_TXF_SHIFT))&SPI_MCR_DIS_TXF_MASK)
//#define SPI_MCR_MDIS_MASK                        0x4000u
//#define SPI_MCR_MDIS_SHIFT                       14
//#define SPI_MCR_MDIS_WIDTH                       1
//#define SPI_MCR_MDIS(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_MCR_MDIS_SHIFT))&SPI_MCR_MDIS_MASK)
//#define SPI_MCR_DOZE_MASK                        0x8000u
//#define SPI_MCR_DOZE_SHIFT                       15
//#define SPI_MCR_DOZE_WIDTH                       1
//#define SPI_MCR_DOZE(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_MCR_DOZE_SHIFT))&SPI_MCR_DOZE_MASK)
//#define SPI_MCR_PCSIS_MASK                       0x3F0000u
//#define SPI_MCR_PCSIS_SHIFT                      16
//#define SPI_MCR_PCSIS_WIDTH                      6
//#define SPI_MCR_PCSIS(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_MCR_PCSIS_SHIFT))&SPI_MCR_PCSIS_MASK)
//#define SPI_MCR_ROOE_MASK                        0x1000000u
//#define SPI_MCR_ROOE_SHIFT                       24
//#define SPI_MCR_ROOE_WIDTH                       1
//#define SPI_MCR_ROOE(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_MCR_ROOE_SHIFT))&SPI_MCR_ROOE_MASK)
//#define SPI_MCR_PCSSE_MASK                       0x2000000u
//#define SPI_MCR_PCSSE_SHIFT                      25
//#define SPI_MCR_PCSSE_WIDTH                      1
//#define SPI_MCR_PCSSE(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_MCR_PCSSE_SHIFT))&SPI_MCR_PCSSE_MASK)
//#define SPI_MCR_MTFE_MASK                        0x4000000u
//#define SPI_MCR_MTFE_SHIFT                       26
//#define SPI_MCR_MTFE_WIDTH                       1
//#define SPI_MCR_MTFE(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_MCR_MTFE_SHIFT))&SPI_MCR_MTFE_MASK)
//#define SPI_MCR_FRZ_MASK                         0x8000000u
//#define SPI_MCR_FRZ_SHIFT                        27
//#define SPI_MCR_FRZ_WIDTH                        1
//#define SPI_MCR_FRZ(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_MCR_FRZ_SHIFT))&SPI_MCR_FRZ_MASK)
//#define SPI_MCR_DCONF_MASK                       0x30000000u
//#define SPI_MCR_DCONF_SHIFT                      28
//#define SPI_MCR_DCONF_WIDTH                      2
//#define SPI_MCR_DCONF(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_MCR_DCONF_SHIFT))&SPI_MCR_DCONF_MASK)
//#define SPI_MCR_CONT_SCKE_MASK                   0x40000000u
//#define SPI_MCR_CONT_SCKE_SHIFT                  30
//#define SPI_MCR_CONT_SCKE_WIDTH                  1
//#define SPI_MCR_CONT_SCKE(x)                     (((uint32_t)(((uint32_t)(x))<<SPI_MCR_CONT_SCKE_SHIFT))&SPI_MCR_CONT_SCKE_MASK)
//#define SPI_MCR_MSTR_MASK                        0x80000000u
//#define SPI_MCR_MSTR_SHIFT                       31
//#define SPI_MCR_MSTR_WIDTH                       1
//#define SPI_MCR_MSTR(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_MCR_MSTR_SHIFT))&SPI_MCR_MSTR_MASK)
///* TCR Bit Fields */
//#define SPI_TCR_SPI_TCNT_MASK                    0xFFFF0000u
//#define SPI_TCR_SPI_TCNT_SHIFT                   16
//#define SPI_TCR_SPI_TCNT_WIDTH                   16
//#define SPI_TCR_SPI_TCNT(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_TCR_SPI_TCNT_SHIFT))&SPI_TCR_SPI_TCNT_MASK)
///* CTAR Bit Fields */
//#define SPI_CTAR_BR_MASK                         0xFu
//#define SPI_CTAR_BR_SHIFT                        0
//#define SPI_CTAR_BR_WIDTH                        4
//#define SPI_CTAR_BR(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_BR_SHIFT))&SPI_CTAR_BR_MASK)
//#define SPI_CTAR_DT_MASK                         0xF0u
//#define SPI_CTAR_DT_SHIFT                        4
//#define SPI_CTAR_DT_WIDTH                        4
//#define SPI_CTAR_DT(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_DT_SHIFT))&SPI_CTAR_DT_MASK)
//#define SPI_CTAR_ASC_MASK                        0xF00u
//#define SPI_CTAR_ASC_SHIFT                       8
//#define SPI_CTAR_ASC_WIDTH                       4
//#define SPI_CTAR_ASC(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_ASC_SHIFT))&SPI_CTAR_ASC_MASK)
//#define SPI_CTAR_CSSCK_MASK                      0xF000u
//#define SPI_CTAR_CSSCK_SHIFT                     12
//#define SPI_CTAR_CSSCK_WIDTH                     4
//#define SPI_CTAR_CSSCK(x)                        (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_CSSCK_SHIFT))&SPI_CTAR_CSSCK_MASK)
//#define SPI_CTAR_PBR_MASK                        0x30000u
//#define SPI_CTAR_PBR_SHIFT                       16
//#define SPI_CTAR_PBR_WIDTH                       2
//#define SPI_CTAR_PBR(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_PBR_SHIFT))&SPI_CTAR_PBR_MASK)
//#define SPI_CTAR_PDT_MASK                        0xC0000u
//#define SPI_CTAR_PDT_SHIFT                       18
//#define SPI_CTAR_PDT_WIDTH                       2
//#define SPI_CTAR_PDT(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_PDT_SHIFT))&SPI_CTAR_PDT_MASK)
//#define SPI_CTAR_PASC_MASK                       0x300000u
//#define SPI_CTAR_PASC_SHIFT                      20
//#define SPI_CTAR_PASC_WIDTH                      2
//#define SPI_CTAR_PASC(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_PASC_SHIFT))&SPI_CTAR_PASC_MASK)
//#define SPI_CTAR_PCSSCK_MASK                     0xC00000u
//#define SPI_CTAR_PCSSCK_SHIFT                    22
//#define SPI_CTAR_PCSSCK_WIDTH                    2
//#define SPI_CTAR_PCSSCK(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_PCSSCK_SHIFT))&SPI_CTAR_PCSSCK_MASK)
//#define SPI_CTAR_LSBFE_MASK                      0x1000000u
//#define SPI_CTAR_LSBFE_SHIFT                     24
//#define SPI_CTAR_LSBFE_WIDTH                     1
//#define SPI_CTAR_LSBFE(x)                        (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_LSBFE_SHIFT))&SPI_CTAR_LSBFE_MASK)
//#define SPI_CTAR_CPHA_MASK                       0x2000000u
//#define SPI_CTAR_CPHA_SHIFT                      25
//#define SPI_CTAR_CPHA_WIDTH                      1
//#define SPI_CTAR_CPHA(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_CPHA_SHIFT))&SPI_CTAR_CPHA_MASK)
//#define SPI_CTAR_CPOL_MASK                       0x4000000u
//#define SPI_CTAR_CPOL_SHIFT                      26
//#define SPI_CTAR_CPOL_WIDTH                      1
//#define SPI_CTAR_CPOL(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_CPOL_SHIFT))&SPI_CTAR_CPOL_MASK)
//#define SPI_CTAR_FMSZ_MASK                       0x78000000u
//#define SPI_CTAR_FMSZ_SHIFT                      27
//#define SPI_CTAR_FMSZ_WIDTH                      4
//#define SPI_CTAR_FMSZ(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_FMSZ_SHIFT))&SPI_CTAR_FMSZ_MASK)
//#define SPI_CTAR_DBR_MASK                        0x80000000u
//#define SPI_CTAR_DBR_SHIFT                       31
//#define SPI_CTAR_DBR_WIDTH                       1
//#define SPI_CTAR_DBR(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_DBR_SHIFT))&SPI_CTAR_DBR_MASK)
///* CTAR_SLAVE Bit Fields */
//#define SPI_CTAR_SLAVE_CPHA_MASK                 0x2000000u
//#define SPI_CTAR_SLAVE_CPHA_SHIFT                25
//#define SPI_CTAR_SLAVE_CPHA_WIDTH                1
//#define SPI_CTAR_SLAVE_CPHA(x)                   (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_SLAVE_CPHA_SHIFT))&SPI_CTAR_SLAVE_CPHA_MASK)
//#define SPI_CTAR_SLAVE_CPOL_MASK                 0x4000000u
//#define SPI_CTAR_SLAVE_CPOL_SHIFT                26
//#define SPI_CTAR_SLAVE_CPOL_WIDTH                1
//#define SPI_CTAR_SLAVE_CPOL(x)                   (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_SLAVE_CPOL_SHIFT))&SPI_CTAR_SLAVE_CPOL_MASK)
//#define SPI_CTAR_SLAVE_FMSZ_MASK                 0x78000000u
//#define SPI_CTAR_SLAVE_FMSZ_SHIFT                27
//#define SPI_CTAR_SLAVE_FMSZ_WIDTH                4
//#define SPI_CTAR_SLAVE_FMSZ(x)                   (((uint32_t)(((uint32_t)(x))<<SPI_CTAR_SLAVE_FMSZ_SHIFT))&SPI_CTAR_SLAVE_FMSZ_MASK)
///* SR Bit Fields */
//#define SPI_SR_POPNXTPTR_MASK                    0xFu
//#define SPI_SR_POPNXTPTR_SHIFT                   0
//#define SPI_SR_POPNXTPTR_WIDTH                   4
//#define SPI_SR_POPNXTPTR(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_SR_POPNXTPTR_SHIFT))&SPI_SR_POPNXTPTR_MASK)
//#define SPI_SR_RXCTR_MASK                        0xF0u
//#define SPI_SR_RXCTR_SHIFT                       4
//#define SPI_SR_RXCTR_WIDTH                       4
//#define SPI_SR_RXCTR(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_SR_RXCTR_SHIFT))&SPI_SR_RXCTR_MASK)
//#define SPI_SR_TXNXTPTR_MASK                     0xF00u
//#define SPI_SR_TXNXTPTR_SHIFT                    8
//#define SPI_SR_TXNXTPTR_WIDTH                    4
//#define SPI_SR_TXNXTPTR(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_SR_TXNXTPTR_SHIFT))&SPI_SR_TXNXTPTR_MASK)
//#define SPI_SR_TXCTR_MASK                        0xF000u
//#define SPI_SR_TXCTR_SHIFT                       12
//#define SPI_SR_TXCTR_WIDTH                       4
//#define SPI_SR_TXCTR(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_SR_TXCTR_SHIFT))&SPI_SR_TXCTR_MASK)
//#define SPI_SR_RFDF_MASK                         0x20000u
//#define SPI_SR_RFDF_SHIFT                        17
//#define SPI_SR_RFDF_WIDTH                        1
//#define SPI_SR_RFDF(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_SR_RFDF_SHIFT))&SPI_SR_RFDF_MASK)
//#define SPI_SR_RFOF_MASK                         0x80000u
//#define SPI_SR_RFOF_SHIFT                        19
//#define SPI_SR_RFOF_WIDTH                        1
//#define SPI_SR_RFOF(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_SR_RFOF_SHIFT))&SPI_SR_RFOF_MASK)
//#define SPI_SR_TFFF_MASK                         0x2000000u
//#define SPI_SR_TFFF_SHIFT                        25
//#define SPI_SR_TFFF_WIDTH                        1
//#define SPI_SR_TFFF(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_SR_TFFF_SHIFT))&SPI_SR_TFFF_MASK)
//#define SPI_SR_TFUF_MASK                         0x8000000u
//#define SPI_SR_TFUF_SHIFT                        27
//#define SPI_SR_TFUF_WIDTH                        1
//#define SPI_SR_TFUF(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_SR_TFUF_SHIFT))&SPI_SR_TFUF_MASK)
//#define SPI_SR_EOQF_MASK                         0x10000000u
//#define SPI_SR_EOQF_SHIFT                        28
//#define SPI_SR_EOQF_WIDTH                        1
//#define SPI_SR_EOQF(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_SR_EOQF_SHIFT))&SPI_SR_EOQF_MASK)
//#define SPI_SR_TXRXS_MASK                        0x40000000u
//#define SPI_SR_TXRXS_SHIFT                       30
//#define SPI_SR_TXRXS_WIDTH                       1
//#define SPI_SR_TXRXS(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_SR_TXRXS_SHIFT))&SPI_SR_TXRXS_MASK)
//#define SPI_SR_TCF_MASK                          0x80000000u
//#define SPI_SR_TCF_SHIFT                         31
//#define SPI_SR_TCF_WIDTH                         1
//#define SPI_SR_TCF(x)                            (((uint32_t)(((uint32_t)(x))<<SPI_SR_TCF_SHIFT))&SPI_SR_TCF_MASK)
///* RSER Bit Fields */
//#define SPI_RSER_RFDF_DIRS_MASK                  0x10000u
//#define SPI_RSER_RFDF_DIRS_SHIFT                 16
//#define SPI_RSER_RFDF_DIRS_WIDTH                 1
//#define SPI_RSER_RFDF_DIRS(x)                    (((uint32_t)(((uint32_t)(x))<<SPI_RSER_RFDF_DIRS_SHIFT))&SPI_RSER_RFDF_DIRS_MASK)
//#define SPI_RSER_RFDF_RE_MASK                    0x20000u
//#define SPI_RSER_RFDF_RE_SHIFT                   17
//#define SPI_RSER_RFDF_RE_WIDTH                   1
//#define SPI_RSER_RFDF_RE(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RSER_RFDF_RE_SHIFT))&SPI_RSER_RFDF_RE_MASK)
//#define SPI_RSER_RFOF_RE_MASK                    0x80000u
//#define SPI_RSER_RFOF_RE_SHIFT                   19
//#define SPI_RSER_RFOF_RE_WIDTH                   1
//#define SPI_RSER_RFOF_RE(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RSER_RFOF_RE_SHIFT))&SPI_RSER_RFOF_RE_MASK)
//#define SPI_RSER_TFFF_DIRS_MASK                  0x1000000u
//#define SPI_RSER_TFFF_DIRS_SHIFT                 24
//#define SPI_RSER_TFFF_DIRS_WIDTH                 1
//#define SPI_RSER_TFFF_DIRS(x)                    (((uint32_t)(((uint32_t)(x))<<SPI_RSER_TFFF_DIRS_SHIFT))&SPI_RSER_TFFF_DIRS_MASK)
//#define SPI_RSER_TFFF_RE_MASK                    0x2000000u
//#define SPI_RSER_TFFF_RE_SHIFT                   25
//#define SPI_RSER_TFFF_RE_WIDTH                   1
//#define SPI_RSER_TFFF_RE(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RSER_TFFF_RE_SHIFT))&SPI_RSER_TFFF_RE_MASK)
//#define SPI_RSER_TFUF_RE_MASK                    0x8000000u
//#define SPI_RSER_TFUF_RE_SHIFT                   27
//#define SPI_RSER_TFUF_RE_WIDTH                   1
//#define SPI_RSER_TFUF_RE(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RSER_TFUF_RE_SHIFT))&SPI_RSER_TFUF_RE_MASK)
//#define SPI_RSER_EOQF_RE_MASK                    0x10000000u
//#define SPI_RSER_EOQF_RE_SHIFT                   28
//#define SPI_RSER_EOQF_RE_WIDTH                   1
//#define SPI_RSER_EOQF_RE(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RSER_EOQF_RE_SHIFT))&SPI_RSER_EOQF_RE_MASK)
//#define SPI_RSER_TCF_RE_MASK                     0x80000000u
//#define SPI_RSER_TCF_RE_SHIFT                    31
//#define SPI_RSER_TCF_RE_WIDTH                    1
//#define SPI_RSER_TCF_RE(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_RSER_TCF_RE_SHIFT))&SPI_RSER_TCF_RE_MASK)
///* PUSHR Bit Fields */
//#define SPI_PUSHR_TXDATA_MASK                    0xFFFFu
//#define SPI_PUSHR_TXDATA_SHIFT                   0
//#define SPI_PUSHR_TXDATA_WIDTH                   16
//#define SPI_PUSHR_TXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_PUSHR_TXDATA_SHIFT))&SPI_PUSHR_TXDATA_MASK)
//#define SPI_PUSHR_PCS_MASK                       0x3F0000u
//#define SPI_PUSHR_PCS_SHIFT                      16
//#define SPI_PUSHR_PCS_WIDTH                      6
//#define SPI_PUSHR_PCS(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_PUSHR_PCS_SHIFT))&SPI_PUSHR_PCS_MASK)
//#define SPI_PUSHR_CTCNT_MASK                     0x4000000u
//#define SPI_PUSHR_CTCNT_SHIFT                    26
//#define SPI_PUSHR_CTCNT_WIDTH                    1
//#define SPI_PUSHR_CTCNT(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_PUSHR_CTCNT_SHIFT))&SPI_PUSHR_CTCNT_MASK)
//#define SPI_PUSHR_EOQ_MASK                       0x8000000u
//#define SPI_PUSHR_EOQ_SHIFT                      27
//#define SPI_PUSHR_EOQ_WIDTH                      1
//#define SPI_PUSHR_EOQ(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_PUSHR_EOQ_SHIFT))&SPI_PUSHR_EOQ_MASK)
//#define SPI_PUSHR_CTAS_MASK                      0x70000000u
//#define SPI_PUSHR_CTAS_SHIFT                     28
//#define SPI_PUSHR_CTAS_WIDTH                     3
//#define SPI_PUSHR_CTAS(x)                        (((uint32_t)(((uint32_t)(x))<<SPI_PUSHR_CTAS_SHIFT))&SPI_PUSHR_CTAS_MASK)
//#define SPI_PUSHR_CONT_MASK                      0x80000000u
//#define SPI_PUSHR_CONT_SHIFT                     31
//#define SPI_PUSHR_CONT_WIDTH                     1
//#define SPI_PUSHR_CONT(x)                        (((uint32_t)(((uint32_t)(x))<<SPI_PUSHR_CONT_SHIFT))&SPI_PUSHR_CONT_MASK)
///* PUSHR_SLAVE Bit Fields */
//#define SPI_PUSHR_SLAVE_TXDATA_MASK              0xFFFFFFFFu
//#define SPI_PUSHR_SLAVE_TXDATA_SHIFT             0
//#define SPI_PUSHR_SLAVE_TXDATA_WIDTH             32
//#define SPI_PUSHR_SLAVE_TXDATA(x)                (((uint32_t)(((uint32_t)(x))<<SPI_PUSHR_SLAVE_TXDATA_SHIFT))&SPI_PUSHR_SLAVE_TXDATA_MASK)
///* POPR Bit Fields */
//#define SPI_POPR_RXDATA_MASK                     0xFFFFFFFFu
//#define SPI_POPR_RXDATA_SHIFT                    0
//#define SPI_POPR_RXDATA_WIDTH                    32
//#define SPI_POPR_RXDATA(x)                       (((uint32_t)(((uint32_t)(x))<<SPI_POPR_RXDATA_SHIFT))&SPI_POPR_RXDATA_MASK)
///* TXFR0 Bit Fields */
//#define SPI_TXFR0_TXDATA_MASK                    0xFFFFu
//#define SPI_TXFR0_TXDATA_SHIFT                   0
//#define SPI_TXFR0_TXDATA_WIDTH                   16
//#define SPI_TXFR0_TXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_TXFR0_TXDATA_SHIFT))&SPI_TXFR0_TXDATA_MASK)
//#define SPI_TXFR0_TXCMD_TXDATA_MASK              0xFFFF0000u
//#define SPI_TXFR0_TXCMD_TXDATA_SHIFT             16
//#define SPI_TXFR0_TXCMD_TXDATA_WIDTH             16
//#define SPI_TXFR0_TXCMD_TXDATA(x)                (((uint32_t)(((uint32_t)(x))<<SPI_TXFR0_TXCMD_TXDATA_SHIFT))&SPI_TXFR0_TXCMD_TXDATA_MASK)
///* TXFR1 Bit Fields */
//#define SPI_TXFR1_TXDATA_MASK                    0xFFFFu
//#define SPI_TXFR1_TXDATA_SHIFT                   0
//#define SPI_TXFR1_TXDATA_WIDTH                   16
//#define SPI_TXFR1_TXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_TXFR1_TXDATA_SHIFT))&SPI_TXFR1_TXDATA_MASK)
//#define SPI_TXFR1_TXCMD_TXDATA_MASK              0xFFFF0000u
//#define SPI_TXFR1_TXCMD_TXDATA_SHIFT             16
//#define SPI_TXFR1_TXCMD_TXDATA_WIDTH             16
//#define SPI_TXFR1_TXCMD_TXDATA(x)                (((uint32_t)(((uint32_t)(x))<<SPI_TXFR1_TXCMD_TXDATA_SHIFT))&SPI_TXFR1_TXCMD_TXDATA_MASK)
///* TXFR2 Bit Fields */
//#define SPI_TXFR2_TXDATA_MASK                    0xFFFFu
//#define SPI_TXFR2_TXDATA_SHIFT                   0
//#define SPI_TXFR2_TXDATA_WIDTH                   16
//#define SPI_TXFR2_TXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_TXFR2_TXDATA_SHIFT))&SPI_TXFR2_TXDATA_MASK)
//#define SPI_TXFR2_TXCMD_TXDATA_MASK              0xFFFF0000u
//#define SPI_TXFR2_TXCMD_TXDATA_SHIFT             16
//#define SPI_TXFR2_TXCMD_TXDATA_WIDTH             16
//#define SPI_TXFR2_TXCMD_TXDATA(x)                (((uint32_t)(((uint32_t)(x))<<SPI_TXFR2_TXCMD_TXDATA_SHIFT))&SPI_TXFR2_TXCMD_TXDATA_MASK)
///* TXFR3 Bit Fields */
//#define SPI_TXFR3_TXDATA_MASK                    0xFFFFu
//#define SPI_TXFR3_TXDATA_SHIFT                   0
//#define SPI_TXFR3_TXDATA_WIDTH                   16
//#define SPI_TXFR3_TXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_TXFR3_TXDATA_SHIFT))&SPI_TXFR3_TXDATA_MASK)
//#define SPI_TXFR3_TXCMD_TXDATA_MASK              0xFFFF0000u
//#define SPI_TXFR3_TXCMD_TXDATA_SHIFT             16
//#define SPI_TXFR3_TXCMD_TXDATA_WIDTH             16
//#define SPI_TXFR3_TXCMD_TXDATA(x)                (((uint32_t)(((uint32_t)(x))<<SPI_TXFR3_TXCMD_TXDATA_SHIFT))&SPI_TXFR3_TXCMD_TXDATA_MASK)
///* RXFR0 Bit Fields */
//#define SPI_RXFR0_RXDATA_MASK                    0xFFFFFFFFu
//#define SPI_RXFR0_RXDATA_SHIFT                   0
//#define SPI_RXFR0_RXDATA_WIDTH                   32
//#define SPI_RXFR0_RXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RXFR0_RXDATA_SHIFT))&SPI_RXFR0_RXDATA_MASK)
///* RXFR1 Bit Fields */
//#define SPI_RXFR1_RXDATA_MASK                    0xFFFFFFFFu
//#define SPI_RXFR1_RXDATA_SHIFT                   0
//#define SPI_RXFR1_RXDATA_WIDTH                   32
//#define SPI_RXFR1_RXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RXFR1_RXDATA_SHIFT))&SPI_RXFR1_RXDATA_MASK)
///* RXFR2 Bit Fields */
//#define SPI_RXFR2_RXDATA_MASK                    0xFFFFFFFFu
//#define SPI_RXFR2_RXDATA_SHIFT                   0
//#define SPI_RXFR2_RXDATA_WIDTH                   32
//#define SPI_RXFR2_RXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RXFR2_RXDATA_SHIFT))&SPI_RXFR2_RXDATA_MASK)
///* RXFR3 Bit Fields */
//#define SPI_RXFR3_RXDATA_MASK                    0xFFFFFFFFu
//#define SPI_RXFR3_RXDATA_SHIFT                   0
//#define SPI_RXFR3_RXDATA_WIDTH                   32
//#define SPI_RXFR3_RXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_RXFR3_RXDATA_SHIFT))&SPI_RXFR3_RXDATA_MASK)
//
///*!
// * @}
// */ /* end of group SPI_Register_Masks */
//
//
/* SPI - Peripheral instance base addresses */
/** Peripheral SPI0 base address */
#define SPI0_BASE                                (0x4002C000u)
/** Peripheral SPI0 base pointer */
#define SPI0                                     ((SPI_Type *)SPI0_BASE)
//#define SPI0_BASE_PTR                            (SPI0)
/** Peripheral SPI1 base address */
#define SPI1_BASE                                (0x4002D000u)
/** Peripheral SPI1 base pointer */
#define SPI1                                     ((SPI_Type *)SPI1_BASE)
//#define SPI1_BASE_PTR                            (SPI1)
/** Peripheral SPI2 base address */
#define SPI2_BASE                                (0x400AC000u)
/** Peripheral SPI2 base pointer */
#define SPI2                                     ((SPI_Type *)SPI2_BASE)
//#define SPI2_BASE_PTR                            (SPI2)
/** Array initializer of SPI peripheral base addresses */
#define SPI_BASE_ADDRS                           { SPI0_BASE, SPI1_BASE, SPI2_BASE }
/** Array initializer of SPI peripheral base pointers */
//#define SPI_BASE_PTRS                        	 { SPI0, SPI1, SPI2 }
/** Interrupt vectors for the SPI peripheral type */
#define SPI_IRQS                                 { SPI0_IRQn, SPI1_IRQn, SPI2_IRQn }
//
///* ----------------------------------------------------------------------------
//   -- SPI - Register accessor macros
//   ---------------------------------------------------------------------------- */
//
///*!
// * @addtogroup SPI_Register_Accessor_Macros SPI - Register accessor macros
// * @{
// */
//
//
///* SPI - Register instance definitions */
///* SPI0 */
//#define SPI0_MCR                                 SPI_MCR_REG(SPI0)
//#define SPI0_TCR                                 SPI_TCR_REG(SPI0)
//#define SPI0_CTAR0                               SPI_CTAR_REG(SPI0,0)
//#define SPI0_CTAR0_SLAVE                         SPI_CTAR_SLAVE_REG(SPI0,0)
//#define SPI0_CTAR1                               SPI_CTAR_REG(SPI0,1)
