akhil-tsdev/With_SensorFusion/wearable/Freescale/Freescale_MQX_4_1/mqx/source/io/spi_ksdk_1_3_0/include/MK22FA12/MK22FA12_spi.h
//#define SPI0_SR                                  SPI_SR_REG(SPI0)
//#define SPI0_RSER                                SPI_RSER_REG(SPI0)
//#define SPI0_PUSHR                               SPI_PUSHR_REG(SPI0)
//#define SPI0_PUSHR_SLAVE                         SPI_PUSHR_SLAVE_REG(SPI0)
//#define SPI0_POPR                                SPI_POPR_REG(SPI0)
//#define SPI0_TXFR0                               SPI_TXFR0_REG(SPI0)
//#define SPI0_TXFR1                               SPI_TXFR1_REG(SPI0)
//#define SPI0_TXFR2                               SPI_TXFR2_REG(SPI0)
//#define SPI0_TXFR3                               SPI_TXFR3_REG(SPI0)
//#define SPI0_RXFR0                               SPI_RXFR0_REG(SPI0)
//#define SPI0_RXFR1                               SPI_RXFR1_REG(SPI0)
//#define SPI0_RXFR2                               SPI_RXFR2_REG(SPI0)
//#define SPI0_RXFR3                               SPI_RXFR3_REG(SPI0)
///* SPI1 */
//#define SPI1_MCR                                 SPI_MCR_REG(SPI1)
//#define SPI1_TCR                                 SPI_TCR_REG(SPI1)
//#define SPI1_CTAR0                               SPI_CTAR_REG(SPI1,0)
//#define SPI1_CTAR0_SLAVE                         SPI_CTAR_SLAVE_REG(SPI1,0)
//#define SPI1_CTAR1                               SPI_CTAR_REG(SPI1,1)
//#define SPI1_SR                                  SPI_SR_REG(SPI1)
//#define SPI1_RSER                                SPI_RSER_REG(SPI1)
//#define SPI1_PUSHR                               SPI_PUSHR_REG(SPI1)
//#define SPI1_PUSHR_SLAVE                         SPI_PUSHR_SLAVE_REG(SPI1)
//#define SPI1_POPR                                SPI_POPR_REG(SPI1)
//#define SPI1_TXFR0                               SPI_TXFR0_REG(SPI1)
//#define SPI1_TXFR1                               SPI_TXFR1_REG(SPI1)
//#define SPI1_TXFR2                               SPI_TXFR2_REG(SPI1)
//#define SPI1_TXFR3                               SPI_TXFR3_REG(SPI1)
//#define SPI1_RXFR0                               SPI_RXFR0_REG(SPI1)
//#define SPI1_RXFR1                               SPI_RXFR1_REG(SPI1)
//#define SPI1_RXFR2                               SPI_RXFR2_REG(SPI1)
//#define SPI1_RXFR3                               SPI_RXFR3_REG(SPI1)
///* SPI2 */
//#define SPI2_MCR                                 SPI_MCR_REG(SPI2)
//#define SPI2_TCR                                 SPI_TCR_REG(SPI2)
//#define SPI2_CTAR0                               SPI_CTAR_REG(SPI2,0)
//#define SPI2_CTAR0_SLAVE                         SPI_CTAR_SLAVE_REG(SPI2,0)
//#define SPI2_CTAR1                               SPI_CTAR_REG(SPI2,1)
//#define SPI2_SR                                  SPI_SR_REG(SPI2)
//#define SPI2_RSER                                SPI_RSER_REG(SPI2)
//#define SPI2_PUSHR                               SPI_PUSHR_REG(SPI2)
//#define SPI2_PUSHR_SLAVE                         SPI_PUSHR_SLAVE_REG(SPI2)
//#define SPI2_POPR                                SPI_POPR_REG(SPI2)
//#define SPI2_TXFR0                               SPI_TXFR0_REG(SPI2)
//#define SPI2_TXFR1                               SPI_TXFR1_REG(SPI2)
//#define SPI2_TXFR2                               SPI_TXFR2_REG(SPI2)
//#define SPI2_TXFR3                               SPI_TXFR3_REG(SPI2)
//#define SPI2_RXFR0                               SPI_RXFR0_REG(SPI2)
//#define SPI2_RXFR1                               SPI_RXFR1_REG(SPI2)
//#define SPI2_RXFR2                               SPI_RXFR2_REG(SPI2)
//#define SPI2_RXFR3                               SPI_RXFR3_REG(SPI2)
//
///* SPI - Register array accessors */
//#define SPI0_CTAR(index2)                        SPI_CTAR_REG(SPI0,index2)
//#define SPI1_CTAR(index2)                        SPI_CTAR_REG(SPI1,index2)
//#define SPI2_CTAR(index2)                        SPI_CTAR_REG(SPI2,index2)
//#define SPI0_CTAR_SLAVE(index2)                  SPI_CTAR_SLAVE_REG(SPI0,index2)
//#define SPI1_CTAR_SLAVE(index2)                  SPI_CTAR_SLAVE_REG(SPI1,index2)
//#define SPI2_CTAR_SLAVE(index2)                  SPI_CTAR_SLAVE_REG(SPI2,index2)
//
///*!
// * @}
// */ /* end of group SPI_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group SPI_Peripheral_Access_Layer */


#endif /* __MK22FA12_SPI_H__ */
